{"pageProps":{"post":{"title":"WWDC20","lang":"jp","date":"2020-03-16T05:35:07.322Z","slug":"2020-06-26-WWDC20-summary","author":{"name":"Tim Neutkens","picture":"/assets/blog/authors/tim.jpeg"},"content":"<p>Every year Apple's <a href=\"https://developer.apple.com/wwdc20/\">WWDC</a> event is a highlight in the Apple developer community, and this year was no different. Because of COVID-19 the event had to take on a new form and move out of Cupertino and into the virtual world. The week was kicked off with the highly anticipated <em>keynote</em> and <em>state of the union</em> talks followed by a daily release of video sessions and developer labs, where developers could book 1:1 sessions with Apple's engineers.</p>\n<p>Even more than in recent years, the leitmotif of a lot of topics Apple covered was the convergence of all platforms within their ecosystem. Starting with the transition to ARM-based CPUs for the entire Mac product line, to universally applicable SwiftUI code, through to macOS Big Sur's new user interface, unification appeared to be the mantra resonating through everything. Take Big Sur's new Desktop, put an iPad next to it, and ask your grandma which one is which.</p>\n<p>For users this means they only have to learn how to use an Apple product once. If you already know how to use an iPhone, chances are you'll have little trouble getting used to an iPad or a Mac. In the majority of cases you'll probably be able to use the same apps.</p>\n<p>For developers it means it should be easier than ever to offer apps on multiple platforms. You just have to make up your mind about which technology to adopt. On iOS your options are manageable. On macOS on the other hand, you can now choose between AppKit, UIKit, Catalyst, and SwiftUI to build the user interface of your app.</p>\n<p>For Apple it means everything they've been able to do with their in-house SoCs powering iOS devices for a number of years now, finally comes home to the Mac. They have full control over the development roadmap of both their software and hardware, on all of their devices.</p>\n<p>Another topic Apple again put a lot of emphasis on, is the privacy of its users, with iOS users gaining even more control over data that is shared with developers or 3rd parties and macOS inheriting a lot of privacy-focused features iOS user have been familiar with for years.</p>\n<h2>Highlights For Users (and Developers)</h2>\n<h3>App Library</h3>\n<p>Apple added an App Library to the last page of the home screen. It automatically organizes and groups all your apps contextually. You can choose how many pages you want to display and hide rarely used apps for a less cluttered home screen and quicker access to App Library. It also provides a search bar at the top, with all apps sorted alphabetically and a quick way to search for apps.</p>\n<p>![]({{ '/assets/img/2020-06-26-WWDC20-summary/app-library.jpg' | relative_url }})\r\n<em>Image source: <a href=\"https://www.apple.com/ios/ios-14-preview/\">App Library</a></em></p>\n<h3>Widgets</h3>\n<p>Apple added widgets to the iOS 14 home screen, allowing you to freely position your widgets alongside your apps on the home screen. There are three different sizes to choose from, depending on how important the content of a widget is to you. When you drag and drop your widget, space between the app icons will automatically be managed based on the position and size of the widget. You can also place a stack of widgets on your home screen and navigate through it using a swipe gesture. As opposed to Today widgets, the new home screen widgets are written exclusively using SwiftUI.</p>\n<p>![]({{ '/assets/img/2020-06-26-WWDC20-summary/widgets.jpg' | relative_url }})\r\n<em>Image source: <a href=\"https://www.apple.com/ios/ios-14-preview/\">Widgets</a></em></p>\n<h3>Picture-in-Picture</h3>\n<p>Apple added Picture-in-Picture support. While watching a video or talking to a friend on FaceTime, it allows you to access other apps on your iOS device at the same time. The below image shows a PiP video displayed alongside the Notes app.</p>\n<p>![]({{ '/assets/img/2020-06-26-WWDC20-summary/picture-in-picture.jpg' | relative_url }})\r\n<em>Image source: <a href=\"https://www.apple.com/ios/ios-14-preview/\">Picture in Picture</a></em></p>\n<h3>Siri</h3>\n<p>Much like the new overlay for incoming calls, Apple redesigned Siri's interface to be less intrusive by not covering the whole screen. Addressing Siri now summons an indicator at the bottom of the screen:</p>\n<p>![]({{ '/assets/img/2020-06-26-WWDC20-summary/siri.jpg' | relative_url }})\r\n<em>Image source: <a href=\"https://www.apple.com/ios/ios-14-preview/\">Siri</a></em></p>\n<p>More ways to send messages using Siri are:</p>\n<ul>\n<li>by Recording audio</li>\n<li>by using your voice for keyboard dictation</li>\n</ul>\n<h3>The Translate App</h3>\n<p>Apple designed the Translate App for conversations. It works completely offline and keeps your conversations private. You can translate your voice and text from and to any of the languages below. In a conversation it can automatically detect who is speaking based on the language that is spoken, and add the translated text to the right side of the conversation.</p>\n<p>![]({{ '/assets/img/2020-06-26-WWDC20-summary/translate.jpg' | relative_url }})\r\n<em>Image source: <a href=\"https://www.apple.com/ios/ios-14-preview/\">Translate App</a></em></p>\n<h3>Messages</h3>\n<ul>\n<li><strong>Conversations:</strong>\r\nYou can now pin conversations and keep the most important messages at the top by swiping right on a conversation and pinning it. For multiple conversations, you can edit pinned content from the menu.</li>\n</ul>\n<p>![]({{ '/assets/img/2020-06-26-WWDC20-summary/pin-conversations.gif' | relative_url }})\r\n<em>Image source: <a href=\"https://www.apple.com/ios/ios-14-preview/\">Conversations</a></em></p>\n<ul>\n<li><strong>Memoji:</strong> Apple added new Memoji customization options, including new hairstyles, face covers, and more.</li>\n</ul>\n<p>![]({{ '/assets/img/2020-06-26-WWDC20-summary/memoji.jpg' | relative_url }})\r\n<em>Image source: <a href=\"https://www.apple.com/ios/ios-14-preview/\">Memoji</a></em></p>\n<ul>\n<li><strong>Groups:</strong> In group conversations, you are now able to add <code>inline replies</code> and <code>mentions</code>. This means you can reply to specific messages and start a thread. You can mention anyone in a group conversation and also update the settings to only be notified when you are mentioned in a group conversation. You can customize your group photo and inside a conversation, you can see the profile pictures of group members aligned around the group photo at the top.</li>\n</ul>\n<p>![]({{ '/assets/img/2020-06-26-WWDC20-summary/group-messages.jpg' | relative_url }})\r\n<em>Image source: <a href=\"https://www.apple.com/ios/ios-14-preview/\">Groups</a></em></p>\n<h3>Maps</h3>\n<p>Apple has added some welcome features to Maps:</p>\n<ul>\n<li><strong>Guides</strong> help you explore new places and can be saved for offline usage.</li>\n<li><strong>Cycling Directions</strong> offer information about elevation, quiet or busy roads, steep passages coming up, and stairs along the route.</li>\n<li><strong>EV routing</strong> shows charging stations along the route which are compatible with your electric vehicle.</li>\n</ul>\n<h2>Highlights For Developers (and Users)</h2>\n<h3><a name=\"swift-5.3\" />What's New in Swift 5.3</h3>\n<p>Every year Apple adds a slew of new features to the Swift Standard library and 2020 was no exception. Some of the highlights from Swift 5.3 include:</p>\n<ul>\n<li>Updates to the standard library adding support for a preview packages</li>\n<li>Updates to enums, fx synthesized conformance to the <code>Comparable</code> protocol and enum cases as protocol witnesses</li>\n<li>Support for multiple trailing closures</li>\n<li>increased availability of implicit <code>self</code> in closures</li>\n<li>Float16</li>\n<li>Multi-pattern catch clauses\r\nYou can read more about what's new in Swift [here.]({% if site.baseurl %}{{ site.baseurl }}{% endif %}{% post_url 2020-06-29-Whats-new-in-Swift %})</li>\n</ul>\n<h3>SwiftUI 2.0</h3>\n<p>When Apple introduced SwiftUI at last year's WWDC, it left a lot of developers with mixed feelings. On the one, everyone was excited about the paradigm shift to a fresh, concise, and declarative approach to building user interfaces. On the other hand, it still left a lot to be desired, lacking some critical features. In short, it was not ready for the main stage.</p>\n<p>This year, Apple added a lot features developers have been asking for. Some highlights include:</p>\n<ul>\n<li><code>LazyVStack</code>, <code>LazyHStack</code>, and <code>List</code> load content on-demand as the user scrolls, much like table and collection views in UIKit</li>\n<li>Leveraging Swift 5.3's <code>@main</code>, there is a new entry point to applications. SwiftUI's new <code>App</code>, <code>Scene</code>, and <code>WindowGroup</code> structs eliminate the need for AppDelegates and SceneDelegates, allowing you to build your entire user interface just using SwiftUI</li>\n<li>The new <code>@StateObject</code> property wrapper allows for creating reference types inside views while ensuring they don't get released for the lifetime of the view</li>\n<li><code>ProgressView</code> adds native activity indicators and progress bars</li>\n<li><code>LazyVGrid</code> and <code>LazyHGrid</code> somewhat address the lack of collection views</li>\n<li><code>TextEditor</code> is the equivalent to UIKit's UITextView</li>\n<li>Better control over scroll views, such as determining the current or scrolling to a specific offset has been added in the form of <code>ScrollViewReader</code> and <code>ScrollViewProxy</code></li>\n</ul>\n<h3>[App Clips]({% if site.baseurl %}{{ site.baseurl }}{% endif %}{% post_url 2020-06-26-Introducing-App-Clips %})</h3>\n<p>App clips offer a promising new way for businesses to increase the discoverability of their apps and services while at the same time eliminating the need to install a full app.</p>\n<p>At a glance, app clips:</p>\n<ul>\n<li>cannot be larger than 10 MB after app thinning</li>\n<li>can share data with containing app using app group containers</li>\n<li>are not added to home screen, not backed up</li>\n<li>are deleted from device after a period of inactivity</li>\n<li>can be built using either UIKit or the new SwiftUI app lifecycle</li>\n</ul>\n<h3>Advances in [ARKit]({% if site.baseurl %}{{ site.baseurl }}{% endif %}{% post_url 2020-06-23-A-first-look-at-Apples-new-Augmented-Reality-features %})</h3>\n<p>Apple has further extended its lead over the competition in AR. This year they introduced features making use of the LiDAR scanner that was added to the iPad Pro earlier this year and that will potentially come to high-end iPhone models this fall. Some highlights include:</p>\n<ul>\n<li>The Depth API offers per-pixel depth information about the user's surroundings, allowing for more precise measurements and object occlusion</li>\n<li>Set location anchors to real-world geo-coordinates to enable AR experiences at specific locations</li>\n<li>Face tracking using the front camera does not require a TrueDepth camera any longer, provided your device has at least an A12 Bionic chip</li>\n</ul>\n<h3>HealthKit</h3>\n<h4>Electrocardiogram (ECG)</h4>\n<p>Third-party apps are now able to read ECG data that can be recorded with the Apple Watch since watchOS 5.2.</p>\n<p>![]({{ '/assets/img/2020-06-26-WWDC20-summary/healthkit-ecg.png' | relative_url }})\r\n<em>Image source: <a href=\"https://developer.apple.com/wwdc20/10182\">What's new in HealthKit, Apple WWDC20 session</a></em></p>\n<p>Apple has added <code>HKElectrocardiogram</code> to the iOS 14 SDK:</p>\n<pre><code class=\"language-swift\">class HKElectrocardiogram: HKSample {\r\n  var classification: HKElectrocardiogram.Classification\r\n  var symptomsStatus: HKElectrocardiogram.SymptomsStatus\r\n  var averageHeartRate: HKQuantity?\r\n  var samplingFrequency: HKQuantity?\r\n  var numberOfVoltageMeasurements: Int\r\n}\n</code></pre>\n<h4>Mobility Data Types</h4>\n<p>New mobility data types have been added:</p>\n<ul>\n<li>Walking speed and step length</li>\n<li>Walking asymmetry and double support percentage</li>\n<li>Stair ascent and descent speed</li>\n<li>Six minute walk test distance</li>\n</ul>\n<h4>Symptom Samples</h4>\n<p>Apple has added symptom samples accessible to developers to HealthKit:</p>\n<ul>\n<li>Mood Changes</li>\n<li>Night Sweats</li>\n<li>Diarrhea</li>\n<li>Wheezing</li>\n<li>Bloating</li>\n<li>Tiredness or Fatigue</li>\n<li>Bladder Incontinence</li>\n<li>Nausea</li>\n<li>Sleep Changes</li>\n<li>Sinus Congestion</li>\n</ul>\n<p>![]({{ '/assets/img/2020-06-26-WWDC20-summary/healthkit-symptoms.png' | relative_url }})\r\n<em>Image source: <a href=\"https://developer.apple.com/wwdc20/10182\">What's new in HealthKit, Apple WWDC20 session</a></em></p>\n<h3>Security and privacy</h3>\n<h4>Encrypted DNS</h4>\n<p>With iOS 14 and macOS 11 Apple will support <strong>DoT</strong> (DNS over TLS) as well as <strong>DoH</strong> (DNS over HTTPS).\r\nBy enabling this, communication with DNS servers will be encrypted. Where normal DNS traffic would communicate using clear text (allowing others to track and profile users) both DoT and DoH prevent any third-parties from tracking DNS queries by encrypting the entire communication.</p>\n<p>Encrypted DNS can be enabled system-wide by setting up a DNS server that supports this or on application-level by developers who want to use their own DNS for resolving addresses.</p>\n<h4>Private MAC address</h4>\n<p>A MAC (Media Access Control) address is a unique identifier that is assigned to the network interface of your device. With iOS 14 you will be able to enable \"Private MAC address\" for WIFI which will change the MAC address periodically and also whenever you switch networks. <strong>This will prevent systems from tracking you (/your device).</strong></p>\n<p>Of course, you can decide to use the real MAC address where applicable. For example it might make sense to do so for your home or work network if the routers use it to recognize your device and grant access.</p>\n<h4>Privacy for Photos, Location, Contacts</h4>\n<ul>\n<li>\n<p><strong>[Photos]({% if site.baseurl %}{{ site.baseurl }}{% endif %}{% post_url 2020-06-29-Privacy-for-Photos-Access %}):</strong> iOS 14 introduces new access levels permissions for Photo Library which allows you to share specific photos/videos or give access to your entire photo library.</p>\n</li>\n<li>\n<p><strong>Location:</strong> With iOS 14, you can now grant an app access to your approximate location, rather than your precise location.</p>\n</li>\n<li>\n<p><strong>Contacts:</strong> With iOS 14, instead of sharing your entire Contacts list in third-party apps, you can now type individual names to automatically fill their corresponding phone numbers, addresses, and other information. The autofill happens on your device, and contacts are not shared with third-party developers without your consent.</p>\n</li>\n</ul>\n<h3>Accessibility</h3>\n<p>This year Apple continues to focus a lot on one of the most important topics nowadays: <strong>Accessibility</strong>. There are a couple of highly recommended sessions talking about improving accessibility by optimizing for <strong>Voice Over</strong>, <strong>Switch Control</strong> as well as making the <strong>visually accessible</strong>.</p>\n<p>You'll find the <a href=\"https://developer.apple.com/news/?id=xpew8919\">relevant sessions here</a>. They are all great, but I found <a href=\"(https://developer.apple.com/wwdc20/10019)\">this one</a> by <a href=\"https://twitter.com/Sommer\">Sommer Panage</a> particularly interesting and eye-opening.</p>\n<p><strong>Be inclusive. Not exclusive!</strong></p>\n<h3><a name=\"swift-package-manager\" />Swift Package Manager</h3>\n<h4>Binary Dependencies</h4>\n<p>If you are using the new manifest version <code>// swift-tools-version:5.3</code> you can include binary dependencies in your package. These are pre-compiled libraries for each supported architecture and therefore won't expose the source code. Once you have set it up other users can include your package as if it was a regular package.</p>\n<ul>\n<li>✅ Great if you want to share a closed source framework using SPM</li>\n<li>✅ Your library packages are protected by a checksum</li>\n<li>✅ Developers can see your method signatures and documentation</li>\n<li>❌ Only available for Apple platforms – no Linux support</li>\n</ul>\n<p>Also, before you start shipping binary dependencies only, bear in mind that you should have a very good business reason to do so; the general drawbacks of using compiled libraries still apply:</p>\n<ul>\n<li>❌ Debugging is way harder</li>\n<li>❌ A package user cannot change the code to make it fit for their purpose or fix an issue</li>\n<li>❌ If a new architecture (e.g. a new iPhone) has been released you cannot support it until the package owner compiles a binary for the new architecture</li>\n</ul>\n<p>More information:</p>\n<ul>\n<li><a href=\"https://github.com/apple/swift-evolution/blob/master/proposals/0272-swiftpm-binary-dependencies.md\">SE-0272 - Package Manager Binary Dependencies</a></li>\n</ul>\n<h4>Resources &#x26; Localization</h4>\n<p>Also new with Swift 5.3 is the option to ship resources and localized resources with a Swift Package. This proves great if you want to ship resources, such as images, HTML, or other content as well as localizations with your package.</p>\n<ul>\n<li>✅ Add Asset catalogs, HTML files, storyboards, databases, resources, even sample code as part of your package</li>\n<li>✅ Provide localized content with your package</li>\n<li>✅ You can define how they should be processed, e.g. if they should be compiled (code), optimized (images) or just copied (e.g. sample source code)</li>\n<li>❌ A developer using your package cannot access your resources directly; if you need them to get access to specific resources, you can add static APIs for them</li>\n</ul>\n<p>More information:</p>\n<ul>\n<li><a href=\"https://github.com/apple/swift-evolution/blob/master/proposals/0271-package-manager-resources.md\">SE-0271 - Package Manager Resources</a></li>\n<li><a href=\"https://github.com/apple/swift-evolution/blob/master/proposals/0278-package-manager-localized-resources.md\">SE-0278 - Package Manager Localized Resources</a></li>\n</ul>\n<h3><a name=\"swift-numerics\" />Swift Numerics</h3>\n<p><a href=\"https://github.com/apple/swift-numerics\">Swift Numerics</a> is a new package that introduces a numerical API for Swift. It comes with two stand alone modules <code>RealModule</code> and <code>ComplexModule</code>. The <code>RealModule</code> defines four protocols:</p>\n<ul>\n<li><code>ElementaryFunctions</code> -> Basic arithmetic functions including the most common geometrical functions we all know and love from school</li>\n<li><code>RealFunctions</code> -> Adds a series of more complex functions that are difficult to implement for complex numbers.</li>\n<li><code>AlgebraicField</code> -> An extension to the Switch <code>SignedNumeric</code> that allows you to represent a number as a field and introduces reciprocal values</li>\n<li><code>Real</code> -> The <code>Real</code> protocol combines all of the above and makes sure that they can be applied to all <code>FloatingPoint</code> conforming types, such as integers, floats, doubles, and any other types that will be added in the future</li>\n</ul>\n<p>The <code>ComplexModule</code> is build on top of the <code>RealModule</code> and adds a new <code>struct Complex&#x3C;RealType> where RealType: Real</code>. It support most of the arithmetic functions already provided for real numbers as well as a set of functions only relevant for complex values.</p>\n<h3>Swift on Server</h3>\n<p>Swift on Server has received a lot of love recently by Apple. They are heavily invested in <a href=\"https://swift.org/server/\">SSWG</a> (Swift Server Working Group) where people from Apple together with others and our friends from <a href=\"https://vapor.codes\">Vapor</a> provide overall technical direction, support and curate packages and make the (Swift) world a better place.</p>\n<p>In this year's WWDC Apple has mentioned <a href=\"https://vapor.codes\">Vapor</a> in their Platform State of the Union and designated a whole session for <a href=\"https://developer.apple.com/wwdc20/10644\">using Swift using AWS Lambda</a>.</p>\n<p>Apart from <a href=\"https://github.com/apple/swift-nio\">Swift NIO</a>, <a href=\"https://github.com/swift-server/swift-aws-lambda-runtime/\">Swift AWS Lambda runtime</a> and <a href=\"https://github.com/apple/swift-crypto\">Swift Crypto</a> many of the new features introduced in this years WWDC are very useful for Server-side Swift development, e.g. the updates to <a href=\"#swift-package-manager\">Swift Package Manager</a>, <a href=\"#swift-5.3\">Swift 5.3</a> or <a href=\"#swift-numerics\">Swift Numerics</a>.</p>\n<h2>WWDC Articles</h2>\n<ul>\n<li>[A first look at Apple's new Augmented Reality features]({% if site.baseurl %}{{ site.baseurl }}{% endif %}{% post_url 2020-06-23-A-first-look-at-Apples-new-Augmented-Reality-features %})</li>\n<li>[What's new in Swift]({% if site.baseurl %}{{ site.baseurl }}{% endif %}{% post_url 2020-06-29-Whats-new-in-Swift %})</li>\n<li>[Introducing App Clips]({% if site.baseurl %}{{ site.baseurl }}{% endif %}{% post_url 2020-06-26-Introducing-App-Clips %})\n<!-- - [Serverless Swift with Lambdas on AWS]({% if site.baseurl %}{{ site.baseurl }}{% endif %}{% post_url 2020-06-23-A-first-look-at-Apples-new-Augmented-Reality-features %}) -->\n<!-- - [What's new in SwiftUI]({% if site.baseurl %}{{ site.baseurl }}{% endif %}{% post_url 2020-06-23-A-first-look-at-Apples-new-Augmented-Reality-features %}) -->\n</li>\n<li>More to come next week</li>\n</ul>\n<p><em>Article Photo by <a href=\"https://www.apple.com/newsroom/images/live-action/wwdc/Apple_wwdc2020_03132020_big.jpg.large.jpg\">Apple</a></em></p>\n","ogImage":{"url":"/assets/blog/hello-world/cover.jpg"},"coverImage":"/assets/blog/hello-world/cover.jpg"},"localization":{"locale":"jp","translations":{"heroTitle":"Monstarlabのエンジニアリングブログへようこそ","heroDescription":"私たちはテクノロジーコミュニティとの交流が大好きで、人々がオンラインで共有する素晴らしい作品の大消費者です。ここでは、少しお返しし、Monstarlabで行うすべてのことに関する技術知識を共有します。","common":{"navHome":"Home","localeSwitcher":"言語"}},"namespace":"home"}},"__N_SSG":true}